## **Imoportando Bibliotecas**

In [1]:
import pandas as pd
import numpy as np

## **Importando Base de Dados Json**

In [2]:
nomes_f = pd.read_json('nomes-f.json')
nomes_m = pd.read_json('nomes-m.json')

In [3]:
# Pegando nomes aleatórios através do método Sample
nomes_m.sample(10)['nome']

79         VALDIR
145         ITALO
29          TIAGO
183        MARLON
7           LUCAS
5           PAULO
100          JOEL
6           PEDRO
19        RODRIGO
95     ALESSANDRO
Name: nome, dtype: object

In [4]:
# Veriricando a quantidade de nomes contidos nas minhas bases
print(f'Quantidade de nomes: {nomes_f.shape[0] + nomes_m.shape[0]}')

Quantidade de nomes: 400

In [5]:
# Crinando um DataFrame Unico
nomes = pd.concat([nomes_f, nomes_m])['nome'].to_frame()
nomes.head()

        nome
0      MARIA
1        ANA
2  FRANCISCA
3    ANTONIA
4    ADRIANA

## **Incluindo ID dos Alunos**

In [6]:
np.random.seed(123)

In [7]:
total_alunos = len(nomes)
total_alunos

400

In [8]:
# Criando os IDs para os alunos de forma aleatória
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [9]:
nomes.head()

        nome  id_aluno
0      MARIA       235
1        ANA        43
2  FRANCISCA       304
3    ANTONIA       156
4    ADRIANA       343

In [10]:
# Preenchendo os Dominios de forma aleatória
dominios = ['@gmailcom', '@hotmail.com']
nomes['dominio'] = np.random.choice(dominios)

In [11]:
# Contatenando valores do DataFrame Através do método cat
# Note que transformei o nome em string a força
nomes['email'] = nomes['nome'].str.cat(nomes['dominio']).str.lower()

In [12]:
nomes

          nome  id_aluno    dominio               email
0        MARIA       235  @gmailcom      maria@gmailcom
1          ANA        43  @gmailcom        ana@gmailcom
2    FRANCISCA       304  @gmailcom  francisca@gmailcom
3      ANTONIA       156  @gmailcom    antonia@gmailcom
4      ADRIANA       343  @gmailcom    adriana@gmailcom
..         ...       ...        ...                 ...
195     WALTER       231  @gmailcom     walter@gmailcom
196    ARLINDO        99  @gmailcom    arlindo@gmailcom
197    MICHAEL       323  @gmailcom    michael@gmailcom
198     ALVARO       383  @gmailcom     alvaro@gmailcom
199    GEOVANE       366  @gmailcom    geovane@gmailcom

[400 rows x 4 columns]

## **Criando tabela de Cursos**

In [13]:
# Bibliotecas necessárias para leitura da Tabela
import html5lib
import xml

In [14]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)

In [15]:
type(cursos)

list

In [16]:
cursos = cursos[0]
cursos.head(3)

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web

In [17]:
# Ronomeando Colune Nome do Curso
cursos.rename(columns={cursos.columns[0]: cursos.columns[0].replace(' ', '_').lower()}, inplace = True)

In [18]:
# Criando a coluna ID para a Coluna de Cursos
total_cursos = len(cursos)
total_cursos


cursos['id'] = np.random.permutation(total_cursos) + 1

In [19]:
cursos.head()

           nome_do_curso  id
0  Lógica de programação  15
1          Java para Web   6
2            C# para Web   1
3          Ruby on Rails   7
4       Cursos de Python   5

In [20]:
# Setando id como Indice na tabela de cursos
cursos = cursos.set_index('id')

In [21]:
cursos.head()

            nome_do_curso
id
15  Lógica de programação
6           Java para Web
1             C# para Web
7           Ruby on Rails
5        Cursos de Python

In [22]:
# Preenchendo a quantidade de matriculas de forma aleatória
nomes['matriculas'] = np.ceil(np.random.exponential(size = total_alunos) * 1.5).astype(int)

In [23]:
nomes

          nome  id_aluno    dominio               email  matriculas
0        MARIA       235  @gmailcom      maria@gmailcom           1
1          ANA        43  @gmailcom        ana@gmailcom           1
2    FRANCISCA       304  @gmailcom  francisca@gmailcom           4
3      ANTONIA       156  @gmailcom    antonia@gmailcom           1
4      ADRIANA       343  @gmailcom    adriana@gmailcom           2
..         ...       ...        ...                 ...         ...
195     WALTER       231  @gmailcom     walter@gmailcom           1
196    ARLINDO        99  @gmailcom    arlindo@gmailcom           1
197    MICHAEL       323  @gmailcom    michael@gmailcom           2
198     ALVARO       383  @gmailcom     alvaro@gmailcom           2
199    GEOVANE       366  @gmailcom    geovane@gmailcom           2

[400 rows x 5 columns]

## **Selecionando cursos**

In [24]:
cursos.head(1)

            nome_do_curso
id
15  Lógica de programação

In [25]:
nomes.head(1)

    nome  id_aluno    dominio           email  matriculas
0  MARIA       235  @gmailcom  maria@gmailcom           1

In [26]:
# Estrutura para realizar calculo aleatório
todas_matriculas = []
x = np.random.rand(20)
prob = x / sum(x)

## **Banco de Dados**

In [27]:
nomes

          nome  id_aluno    dominio               email  matriculas
0        MARIA       235  @gmailcom      maria@gmailcom           1
1          ANA        43  @gmailcom        ana@gmailcom           1
2    FRANCISCA       304  @gmailcom  francisca@gmailcom           4
3      ANTONIA       156  @gmailcom    antonia@gmailcom           1
4      ADRIANA       343  @gmailcom    adriana@gmailcom           2
..         ...       ...        ...                 ...         ...
195     WALTER       231  @gmailcom     walter@gmailcom           1
196    ARLINDO        99  @gmailcom    arlindo@gmailcom           1
197    MICHAEL       323  @gmailcom    michael@gmailcom           2
198     ALVARO       383  @gmailcom     alvaro@gmailcom           2
199    GEOVANE       366  @gmailcom    geovane@gmailcom           2

[400 rows x 5 columns]

In [28]:
from sqlalchemy import create_engine, MetaData, Table, inspect # adicionando o método inspect

engine = create_engine('sqlite:///:memory:')
engine
type(engine)

# Salvandos os dado No bando
nomes.to_sql('nomes', engine)

inspector = inspect(engine) # criando um Inspector object
print(inspector.get_table_names()) # Exibindo as tabelas com o inspecto

['nomes']

### **Realizando Consultas no Banco**

In [29]:
# Query que contem o comando para a busca 
query = 'select * from nomes where dominio = "@gmailcom"'

# Passando o comando para a consulta
pd.read_sql(query, engine)

     index       nome  id_aluno    dominio               email  matriculas
0        0      MARIA       235  @gmailcom      maria@gmailcom           1
1        1        ANA        43  @gmailcom        ana@gmailcom           1
2        2  FRANCISCA       304  @gmailcom  francisca@gmailcom           4
3        3    ANTONIA       156  @gmailcom    antonia@gmailcom           1
4        4    ADRIANA       343  @gmailcom    adriana@gmailcom           2
..     ...        ...       ...        ...                 ...         ...
395    195     WALTER       231  @gmailcom     walter@gmailcom           1
396    196    ARLINDO        99  @gmailcom    arlindo@gmailcom           1
397    197    MICHAEL       323  @gmailcom    michael@gmailcom           2
398    198     ALVARO       383  @gmailcom     alvaro@gmailcom           2
399    199    GEOVANE       366  @gmailcom    geovane@gmailcom           2

[400 rows x 6 columns]

In [30]:
# Buscando uma tabela inteira e filtrando coluns
dados = pd.read_sql_table('nomes', engine, columns=['nome', 'dominio']).head()
dados

        nome    dominio
0      MARIA  @gmailcom
1        ANA  @gmailcom
2  FRANCISCA  @gmailcom
3    ANTONIA  @gmailcom
4    ADRIANA  @gmailcom

In [31]:
# Salvando os dados da consulta em um nova tabela do Banco
dados.to_sql('dados', con = engine)

5

In [32]:
# Veriricando todas as tabelas que tenho no meu Banco de Dados
inspector = inspect(engine) # criando um Inspector object
print(inspector.get_table_names()) # Exibindo as tabelas com o inspecto

['dados', 'nomes']